sequence.org
#+title: sequence
#+html_link_home: index

** paper: Recounting the rationals

   The paper defines a well function that generating a sequence ~f~, turns out making whole rationals without repeating, the recurrence definition of ~f~ is

   1. ~f(2n+1) = f(n)~
   2. ~f(2n+2) = f(n) + f(n+1)~
   3. where ~n = (0, 1, 2, ...)~

   The rational are generated by ~f(n)/f(n+1)~, where ~n ≥ 0~

   A julia program can do this

   #+begin_src julia
   function f(n)
     if n == 0
       1
     elseif n % 2 == 1
       f((n - 1) / 2)
     elseif n % 2 == 0
       n1::BigInt = (n - 2) / 2
       f(n1) + f(n1 + 1)
     end
   end

   function r(n)
     "$(f(n))/$(f(n+1))"
   end
   #+end_src

   The only little pity is julia will not show correct rational if I put ~/~ operator in julia there, but have to use string interpolation.

