sequence.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-03 Fri 12:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>sequence</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index"> HOME </a>
</div><div id="content">
<h1 class="title">sequence</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd67d1dd">1. paper: Recounting the rationals</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd67d1dd" class="outline-2">
<h2 id="orgd67d1dd"><span class="section-number-2">1</span> paper: Recounting the rationals</h2>
<div class="outline-text-2" id="text-1">
<p>
The paper defines a well function that generating a sequence <code>f</code>, turns out making whole rationals without repeating, the recurrence definition of <code>f</code> is
</p>

<ol class="org-ol">
<li><code>f(2n+1) = f(n)</code></li>
<li><code>f(2n+2) = f(n) + f(n+1)</code></li>
<li>where <code>n = (0, 1, 2, ...)</code></li>
</ol>

<p>
The rational are generated by <code>f(n)/f(n+1)</code>, where <code>n ≥ 0</code>
</p>

<p>
A julia program can do this
</p>

<div class="org-src-container">
<pre class="src src-julia">   function f(n)
     if n == 0
       1
     elseif n % 2 == 1
       f((n - 1) / 2)
     elseif n % 2 == 0
       n1::BigInt = (n - 2) / 2
       f(n1) + f(n1 + 1)
     end
   end

   function r(n)
     "$(f(n))/$(f(n+1))"
   end
</pre>
</div>

<p>
The only little pity is julia will not show correct rational if I put <code>/</code> operator in julia there, but have to use string interpolation.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-03-03 Fri 12:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
